---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencySketch
source: html/c25129fb-f6e7-0671-1e47-d8319c9adc02.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencySketch Property

Constraints in sketches of highlighted elements cause a circular chain of references.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencySketch { get; }
```